Revit 2027 API
PlanViewRange.GetOffset Method
 Get the offset value associated with a View Depth plane
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double GetOffset(
	PlanViewPlane planViewPlane
)
Public Function GetOffset (
	planViewPlane As PlanViewPlane
) As Double
public:
double GetOffset(
	PlanViewPlane planViewPlane
)
member GetOffset :
        planViewPlane : PlanViewPlane -> float
Parameters
planViewPlane PlanViewPlane
 View Depth plane
Return Value
Double
 Offset value
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
PlanViewRange Class
Autodesk.Revit.DB Namespace